{"con": 0, "txt": "Well it's great that he did something about those beliefs while he was in office. I doubt Trump would fight the UN for it so I'm really really happy Obama did something while he could.......oh wait...."}
{"con": 0, "txt": "You are right Mr. President."}
{"con": 0, "txt": "You have given no input apart from saying I am wrong. You have no argument clearly."}
{"con": 0, "txt": "I get the frustration but the reason they want them to do it that way is because its the foundation for more complex problems as they advance in grades. I can get a decent grade on an SAT type test for math, but I don't really understand a lot of the mathematical ways to get the right answer. Lots of times you can figure out a \"common sense\" work around to a lot of the questions, but I would be ill prepared to take college level math courses despite the above average math score. \n\nThey're not just trying to bust the kids balls."}
{"con": 0, "txt": "I am far from an expert on TPP and I would tend to agree that it had a lot of problems but my understanding was that Obama was pushing it to create an economic bulwark against China in the Pacific. \n\nHis administration recognized the increasing strength, maturity and bellicosity (see South China Sea) and recognized that the US and it's allies had to push for increased penetration into the many emerging markets that would otherwise naturally tend to align with China. \n\nI always thought it curious that in the many critiques of TPP you hardly saw mention of why Obama would be pushing for it. He hardly has he track record of someone trying to railroad workers for corporate interests so there must have been something he felt was hugely important to use so much political capital on something like TPP. \n\nMaybe TPP could have been better (it certainly seems so) yet maybe it was the best Obama could manage given the many and varied interests at play. However it does seem that it would have been in the US strategic interest and if we not only throw it out but begin a significant withdrawal from foreign markets that China will definitely move to fill the void. \n\nSo we may very well be looking at the end of Western economic hegemony with the election of Trump and the ascendency of other nationalistic movements in Britain, France and elsewhere. \n\nWhat's so sad is that it appears to be entirely self-inflicted. There is nothing forcing the retraction of the developed democracies, it seems to simply be the result of myopic reactions to globalism."}